#  todo: Дан номер месяца (1 — январь, 2 — февраль, ...). Вывести название соответствующего
#  времени года ("зима", "весна" и т.д.).

# По номеру месяца определяем время года
def get_season(month):
    if month in [12, 1, 2]:
        return "зима"
    elif month in [3, 4, 5]:
        return "весна"
    elif month in [6, 7, 8]:
        return "лето"
    elif month in [9, 10, 11]:
        return "осень"
    else:
        return "Неверный номер месяца"


# Основная программа
def main():
    try:
        # Считываем номер месяца от пользователя
        month_number = int(input("Введите номер месяца (1-12): "))

        # Проверяем, что номер месяца находится в допустимом диапазоне
        if 1 <= month_number <= 12:
            # Выводим название времени года для данного месяца
            season = get_season(month_number)
            print(f"\nМесяц номер {month_number} относится к сезону: {season}")
        else:
            print("\nНеверный номер месяца. Пожалуйста, введите номер от 1 до 12.")
            main()  # Снова запрашиваем
    except ValueError:
        print("Пожалуйста, введите корректное числовое значение.")
        main()  # Если юзер не понял, требуем ввода годной цифры или годного числа ещё раз 😁


main()