#todo: Даны три точки A , B , C на числовой оси. Найти длины отрезков AC и BC и их сумму.
# Примечание: все точки получаем через функцию input().

# Получаем координаты точек A, B и C с помощью функции input()
a = float(input("Введите координату точки A: "))
b = float(input("Введите координату точки B: "))
c = float(input("Введите координату точки C: "))

# # Вычисляем длину отрезка AC
# if (c >= 0 and a >= 0) or (c < 0 and a < 0):
#     ac = abs(a - c)
# elif c < 0 and a >= 0:
#     ac = a + abs(c)
# elif c >= 0 and a < 0:
#     ac = abs(a) + c
# else:
#     print("Непонятные введённые значения!!!")

# Вычисляем длину отрезка BC
# Вычисляем длину отрезка AC
# if (c >= 0 and b >= 0) or (c < 0 and b < 0):
#     bc = abs(b - c)
# elif c < 0 and b >= 0:
#     bc = b + abs(c)
# elif c >= 0 and b < 0:
#     bc = abs(b) + c
# else:
#     print("Непонятные введённые значения!!!")

# Вычисляем длину отрезка AC
ac = abs(c - a)  # Используем функцию abs() для нахождения абсолютного значения разности координат точек A и C

# Вычисляем длину отрезка BC
bc = abs(c - b)  # Используем функцию abs() для нахождения абсолютного значения разности координат точек B и C

# Выводим результаты на экран
print(f"Длина отрезка AC: {ac}")
print(f"Длина отрезка BC: {bc}")
print(f"Сумма длин отрезков AC и BC: {ac + bc}")